---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.CurveElement
source: html/41e97058-e4e4-5892-7112-c1f6fa03bb02.htm
---
# CurveElement Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.